package hahaha.lalala.start;

/**
 * 并行：
 * 多核CPU 可以每一核处理一个程序
 * 并发：
 * 以单核CPU为例
 * qq  微信  qq音乐   yy语音  LOL
 * 在某一个时间片(单位特别小的时间) CPU只能执行一个任务
 * 抽刀断水
 * 秒杀...  小米    10000台手机
 * 10万人
 * <p>
 * 程序： 为了实现某一个功能  选择一门语言 进行开发  代码的指令集合
 * <p>
 * 软件： 一个或者多个程序 及其对应的图片资源 视频资源 等其他资源 共同组成的系统
 * 微信： 微信小程序
 * 进程： 开启一个软件  那么 就会在 操作系统中开辟一个进程
 * 多次打开软件 会 开辟多个进程
 * <p>
 * 线程： 一个进程内会有多个线程
 * 每一个线程 可以完成 独立的功能
 * <p>
 * <p>
 * 开启一个软件  那么 就会在 操作系统中开辟一个进程  操作系统会给 此进程分配资源 内存资源为例
 * 线程 共享 进程的资源
 * <p>
 * 进程与进程之间 共享资源你  比较麻烦
 * <p>
 * 线程调度： CPU执行线程
 * 分时调度：
 * 抢占式调度：
 */
public class Test {
    public static void main(String[] args) {

    }
}
